# -*- coding: utf-8 -*-
'''为猫物实体添加获取自“时间轴”条目的“死亡于时间线”陈述。'''
import pywikibot
from utils import cp2zh
from utils import zh2cp
from utils.timeline.years import years as timeline

def main():
    cp = pywikibot.Site('en', 'crystalpool')
    repo = cp.data_repository()
    text = '''{{NoteTA|G1=Basic|G2=Characters
|1={{LTRule|Clear Sky}}
|2={{LTRule|Thunder}}
|3={{LTRule|Storm}}
}}
本页面将针对《猫武士》系列中的时间线进行简单整理。

由于事件众多，本时间轴将集中在主要角色和重大事件上；关于配角的生死事件等，请参考各个时间轴的子页面。

== 导览 ==
=== 年代划分 ===
本时间轴主要划分为五个年代。
* \'''远古\'''是指比上古更久远的年代，比[[远古猫|湖边猫群]]更远的世代。
* \'''上古\'''是指湖边猫群迁徙至山区并创立远古部落以后，直到《族群黎明》系列的最新进度。
* \'''中古\'''是指《荒野手册》－尤其是《族群的守则》的破碎时间线。
* \'''近代\'''是指天族离开森林后，直到拉斯特加入雷族的时间线。
* \'''现代\'''是指拉斯特加入雷族后，直到《破灭守则》的最新进度。

=== 时间依据 ===
* [[蓝星]]出生时，天族已离开森林20年。{{r|btwCJandBP}}
* 《[[松星的抉择]]》发生在枫荫死亡3年后。{{r|btwMVandPC}}
* 《[[鹅羽的诅咒]]》和《[[枫荫的复仇]]》之间差了9年。{{r|btwMVandGC}}
* [[维琪]]曾说部落是60年前离开湖区的，当时《三力量》刚完结。{{r|ehc6}}
** 然而这表示从部落创立到天族离开只有30年间隔，中间还要产生14条守则，几乎不可能。

=== 判断依据 ===
* 在一般情况下，默认武士学徒必须6个月大，武士必须12个月大。
* 母猫的怀孕期平均约2个月（9周）。{{r|pregnancy}}
** 默认只有超过1岁的母猫会怀孕。
** 默认幼崽必须隔季才能出生－最年轻的猫后至少5季大。

== 上古 ==
=== N年 ===
{{/上古1年}}

=== N+1年 ===
{{时间轴
|新叶季书籍=《[[追随太阳]]》{{r|dc1|184-185}}
|新叶季事件=
* 猫群在高地上建立营地，{{r|dc1}}部分猫离开并搬迁至森林。{{r|dc1}}
* [[玳尾]]为了和[[班布尔]]一起生活而离开，成为了宠物猫。{{r|dc1}}
|新叶季死亡=[[跹叶]]{{r|dc4bs|8}}
<!---->
|绿叶季书籍=《[[追随太阳]]》{{r|dc1|266}}
<!---->
|落叶季书籍=《[[追随太阳]]》{{r|dc1|268}}{{r|dc2|14}}
|落叶季事件=
* 晴天的猫群开始扩展领土并守卫边界。{{r|dc1}}
* 锯峰从树上跌落，晴天将他逐出猫群。{{r|dc1}}
* 暴雨离开晴天猫群，在试图保护她的幼崽时被倒塌的两脚兽巢穴压死。{{r|dc1}}
* 灰翅救回了其中一只，并将他命名为雷电。{{r|dc1}}
* 晴天拒绝扶养他的儿子，于是灰翅收养了他。{{r|dc1}}
|落叶季出生=〔[[雷星|雷电]]和两只幼崽〕{{r|dc1|330}}、〔[[闪电尾]]、[[橡子毛]]〕{{r|dc3|43}}
|落叶季死亡=[[狐狸 (早期定居者)|{{LT|Fox}}]]{{r|dc1|291}}、〔[[暴雨]]、两只幼崽〕{{r|dc1|305}}
}}

=== N+2年 ===
{{时间轴
|新叶季书籍=《[[雷电崛起]]》{{r|dc2}}
|新叶季事件=
* 玳尾回到高地并生下了[[汤姆]]的幼崽；灰翅成为他们的养父。{{r|dc2}}
* [[风星|疾风]]和[[金雀星|{{LT|Gorse}}]]救了锯峰，但高影一开始拒绝让他们加入，但最后终于同意。{{r|dc2}}
* 森林被大火吞噬，晴天的猫群被迫暂居高地。{{r|dc2}}
* 雷电加入了晴天的猫群。{{r|dc2}}
|新叶季出生=〔[[枭星]]、[[卵石心]]、[[雀毛 (早期定居者)|{{LT|Sparrow Fur}}]]〕{{r|dc2|98}}
|新叶季死亡=[[月影]]{{r|dc2|227}}
<!---->
|绿叶季书籍=《[[雷电崛起]]》{{r|dc2}}、<br/>《[[首次战争]]》{{r|dc3|13}}、<br/>《[[燃烧之星]]》{{r|dc4|46}}
|绿叶季事件=
* 晴天开始扩张领土，并杀死了反对并抵抗的[[薄雾]]。{{r|dc2}}
* 晴天放逐了[[寒霜|{{LT|Frost}}]]，雷电和他一起离开并重新加入高影的猫群。{{r|dc2}}{{r|dc3}}
* 汤姆带走了玳尾的幼崽，间接导致她在找回孩子的途中被怪兽撞死。{{r|dc3}}雷电和闪电尾在[[河星|河波]]的帮助下带回了他们。{{r|dc3}}
* 高影的猫群和晴天的猫群爆发战争，双方皆死伤惨重。{{r|dc3}}
* [[星族|灵猫]]出现并告诉他们“团结或死亡”。{{r|dc3}}
* 灵猫拜访各首领，要他们向“燃烧之星”一样散开。{{r|dc3}}
|绿叶季出生=〔[[桤木|{{LT|Alder}}]]、[[桦树|{{LT|Birch}}]]〕{{r|dc3|15}}、〔[[蛾飞]]、[[尘鼻]]、[[小烬 (族群黎明)|小烬]]、[[晨须]]〕{{r|dc3|138-139}}、〔[[黑莓|{{LT|Bramble (DotC)}}]]、[[苜蓿 (雷族)|{{LT|Clover (DotC)}}]]、[[蓟草 (雷族)|{{LT|Thistle (DotC)}}]]〕{{r|dc3|262}}
|绿叶季死亡=[[薄雾]]{{r|dc2|260}}、[[班布尔]]{{r|dc2|282}}、[[玳尾]]{{r|dc3|194}}、[[小烬 (族群黎明)|小烬]]{{r|dc3|194}}、〔[[杉果|{{LT|Fircone}}]]、[[寒霜|{{LT|Frost}}]]、[[雨花 (早期定居者)|{{LT|Rainswept Flower}}]]〕{{r|dc3|264}}、〔[[落羽]]、[[鸦鸣]]、[[鹰击 (早期定居者)|{{LT|Hawk Swoop}}]]〕{{r|dc3|271}}
<!---->
|落叶季书籍=《[[燃烧之星]]》{{r|dc4|56}}
|落叶季事件=
* 一场瘟疫开始在森林里扩散。{{r|dc4}}
* [[一眼]]控制了晴天的猫群，并将他逐出。{{r|dc4}}
* [[星花]]利用雷电套出了他们围攻一眼的计划，但最终雷电还是杀死了一眼。{{r|dc4}}
* 猫群最终取得了疾病的解药——燃烧之星，并治愈了病猫。{{r|dc4}}
* 日影和寂雨为了寻找亲族而离开山区。{{r|dc4bs}}
|落叶季出生=〔[[暴皮]]、[[露鼻]]、[[鹰羽]]〕{{r|dc4|262}}
|落叶季死亡=[[汤姆]]{{r|dc4|105}}、[[晨须]]{{r|dc4|123}}、[[一眼]]{{r|dc4|239-240}}、[[花瓣 (早期定居者)|花瓣]]{{r|dc4|252}}、[[半月]]{{r|dc4bs|23}}
<!---->
|秃叶季书籍=《[[占地为王]]》{{r|dc5|8}}、<br/>《[[群星之路]]》{{r|dc6|3}}
|秃叶季事件=
* 猫群分裂成高影营地、晴天营地、河波营地和风逐营地。{{r|dc5}}
* 受够了晴天的霸道，雷电带领部分猫离开并在附近的森林建造了自己的营地。{{r|dc5}}
* 寂雨和日影抵达森林，并加入高影的猫群。{{r|dc5}}她最终原谅了晴天害死部落伙伴的所作所为。{{r|dc5}}
* [[刀疤]]囚禁了晴天怀孕的伴侣——星花，但她最终获救。{{r|dc5}}{{r|dc6}}
* [[红爪 (早期定居者)|红-{}-爪]]意外将狗引入了刀疤营地，导致部分猫死亡。{{r|dc6}}各猫营同意收留部分泼皮猫。{{r|dc6}}
* 刀疤带走了灰翅和[[深灰|{{LT|Slate}}]]的幼崽——黑耳。{{r|dc6}}他获救后，刀疤也离开了森林。{{r|dc6}}
* 灰翅在临终前和他的幼崽一起将猫群依照首领命名为影族、天族、河族、风族和雷族，最后加入了星族。{{r|dc6}}
|秃叶季出生=〔[[细枝]]、[[花脚]]、[[露瓣]]〕{{r|dc6|72}}、〔[[黑耳]]、[[银斑 (风族)|{{LT|Silver Stripe}}]]、[[白尾 (早期定居者)|白尾]]〕{{r|dc6|214}}、〔[[苹果花]]、[[蜗牛壳]]〕{{r|mfv|222}}
|秃叶季死亡=[[黑莓|{{LT|Bramble (DotC)}}]]{{r|dc5|113}}、[[寂雨]]{{r|dc5|302}}、〔[[石头 (族群黎明)|石头]]、[[比奇]]、[[青蛙 (泼皮猫)|青蛙]]〕{{r|dc6|167}}、[[灰翅]]{{r|dc6|307-308}}
}}

=== N+3年 ===
{{时间轴
|新叶季书籍=《[[蛾飞的幻象]]》
|新叶季事件=
* 蛾飞发现了[[月亮石]]，并成为首任巫医。{{r|mfv}}她将灵猫的猫群命名为星族。{{r|mfv}}
* [[迈卡]]从树上跌落死亡。
|新叶季出生=〔[[褐洞]]、[[颤玫]]、[[晨火]]〕{{r|mfv}}、〔[[暗毛|{{LT|Shade Pelt}}]]、[[暮鼻]]、[[摆叶]]〕{{r|mfv}}
|新叶季死亡=[[迈卡]]{{r|mfv}}
<!---->
|绿叶季书籍=《[[蛾飞的幻象]]》
|绿叶季事件=
* 蛾飞生下了米迦的孩子。{{r|mfv}}
* 杨柳尾的谎言造成风族和天族爆发战斗，风逐受了重伤。{{r|mfv}}
* 蛾飞将风族族长带到月亮石，星族赐予她九命，并将其更名为风星。{{r|mfv}}
* 其他四族族长也获得了九命和名字－雷星、河星、影星和天星。{{r|mfv}}
* 蛾飞意识到她无法在照顾幼崽的情况下同时照顾族群，她将孩子分送给其他族群，并立下了巫医不得拥有伴侣的规定。{{r|mfv}}
{{Expand section}}
|绿叶季出生=〔[[沸溪]]、[[蜜皮]]、[[蓝须]]、[[蛛掌|蛛-{}-掌]]〕{{r|mfv}}
|绿叶季死亡=[[细枝|{{LT|Tiny Branch}}]]{{r|mfv}}、[[杨柳尾]]{{r|mfv}}
<!---->
|落叶季书籍=《[[蛾飞的幻象]]》
|落叶季事件={{Coming soon}}
}}

=== N+4年 ===
{{时间轴
|新叶季书籍=《[[雷星的怀响]]》
|新叶季事件=
* 一群狗侵入雷族营地。{{r|te}}
|新叶季出生=〔[[榉尾]]、[[斑皮 (雷星的怀响)|斑皮]]〕{{r|te}}、〔[[闪电条]]、[[壳爪|壳爪]]、[[滑毛]]、[[羽耳]]〕{{r|te}}
|新叶季死亡=[[闪电尾]]{{r|te}}
<!---->
|绿叶季书籍=《[[雷星的怀响]]》
|绿叶季事件=
* 蛾飞生下了米迦的孩子。{{r|mfv}}
* 杨柳尾的谎言造成风族和天族爆发战斗，风逐受到了重伤。{{r|mfv}}
* 蛾飞将风族族长带到月亮石，星族赐予她九命，并将之更名为风星。{{r|mfv}}
* 其他四族族长也获得了九命和名字－雷星、河星、影星和天星。{{r|mfv}}
* 蛾飞意识到她无法在照顾幼崽的情况下同时照顾族群，她将孩子分送给其他族群，并立下了巫医不得拥有伴侣的规定。{{r|mfv}}
* [[枭星|枭眼]]成为雷族副族长。{{r|te}}
}}

== 近代 ==
=== 0年 ===
请参阅[[时间轴/天族线|天族线]]。
{{时间轴
|新叶季书籍=《[[云星的旅程]]》{{DR|untold|cn=<!--cj1章-->|tw=13}}
|新叶季事件=
* [[两脚兽]]破坏天族领地。{{DR|untold|cn=<!--cj3章-->|tw=33}}
<!---->
|绿叶季书籍=《[[云星的旅程]]》{{DR|untold|cn=<!--cj6章-->|tw=54}}
|绿叶季事件=
* 天族离开[[森林领地|森林]]。{{DR|untold|cn=<!--cj10章-->|tw=86}}
* [[鸟飞]]带着[[云星]]的孩子加入雷族。{{DR|untold|cn=<!--cj10章-->|tw=85}}
|绿叶季出生=〔[[金雀掌|{{LT|Gorseclaw (TC)}}]]、[[斑皮 (火星的探索)|斑皮]]〕{{DR|untold|cn=<!--cj10章-->|tw=61}}
|绿叶季死亡=[[花瓣落]]{{DR|untold|cn=<!--cj7章-->|tw=77}}
}}

=== 8年 ===
请参阅[[时间轴/四族初期|四族初期]]。
{{时间轴
|绿叶季书籍=《[[枫荫的复仇]]》{{DR|mv|cn=|tw=|en=2章}}
|绿叶季死亡=[[燕麦斑]]{{Efn|name=death}}{{DR|mv|cn=|tw=|en=2章}}
<!---->
|落叶季书籍=《[[枫荫的复仇]]》{{DR|mv|cn=|tw=|en=3章}}
|落叶季事件=
* 枫荫的幼崽被雷族逐出后溺亡，她开始展开报复行动，直到最后加入了[[无星之地|黑森林]]。{{DR|mv|cn=|tw=|en=9章}}
|落叶季出生=〔[[小叶松 (枫荫的复仇)|小叶松]]、[[小斑 (枫荫的复仇)|小斑]]、[[小花瓣 (枫荫的复仇)|小花瓣]]〕{{Efn|name=birth}}{{DR|mv|cn=|tw=|en=3章}}
|落叶季死亡=〔[[小叶松 (枫荫的复仇)|小叶松]]、[[小斑 (枫荫的复仇)|小斑]]、[[小花瓣 (枫荫的复仇)|小花瓣]]〕{{DR|mv|cn=|tw=|en=4章}}、[[乌翅]]{{DR|mv|cn=|tw=|en=6章}}、[[斑愿 (雷族)|斑愿]]{{r|frecklewishTC}}、[[苹果暮]]{{DR|mv|cn=|tw=|en=9章}}、[[枫荫]]{{DR|mv|cn=|tw=|en=9章}}
}}
{{Notelist|refs=
{{Efn|name=death|枫荫于“落叶季初”生产，当时燕麦斑刚死两个月。}}
{{Efn|name=birth|枫荫的幼崽在“落叶季末”时正好两个月大，表示在季初出生。}}
}}

=== 10年 ===
请参阅[[时间轴/四族初期|四族初期]]。
{{时间轴
|绿叶季出生=[[风飞]]{{Efn|name=wf}}{{r|windflightAge}}
<!---->
|秃叶季出生=[[松星]]{{Efn|name=app}}{{DR|pc|cn=|tw=|en=1章}}
}}
{{Notelist|refs=
{{Efn|name=wf|风飞在“落叶季”时成为武士三个月。}}
{{Efn|name=app|松爪在“绿叶季”时刚当上学徒。}}
}}

=== 11年 ===
请参阅[[时间轴/四族初期|四族初期]]。
{{时间轴
|绿叶季书籍=《[[松星的抉择]]》{{DR|pc|cn=|tw=|en=1章}}
|绿叶季事件=
* 松爪成为雷族学徒。{{DR|pc|cn=|tw=|en=1章}}
* 影族闯入雷族领土，但被逐出。{{DR|pc|cn=|tw=|en=1章}}
* 宠物猫[[克莉斯托]]赶走了母狐狸，救了松爪。{{DR|pc|cn=|tw=|en=2章}}
|秃叶季书籍=《[[松星的抉择]]》{{Efn|name=app}}{{DR|pc|cn=|tw=|en=3章}}
|秃叶季事件=
* [[雷族]]为了教训越界的[[宠物猫]]而派出[[巡逻队]]攻击[[两脚兽地盘]]。{{DR|pc|cn=|tw=|en=3章}}
** 松爪对族猫说谎，以保护克莉斯托和其幼崽（[[杰克]]）。{{DR|pc|cn=|tw=|en=3章}}
* 松心成为雷族武士。{{DR|pc|cn=|tw=|en=3章}}
}}
{{Notelist|refs=
{{Efn|name=app|松爪当了将近6个月的学徒后。}}
}}

=== 17年 ===
请参阅[[时间轴/四族初期|四族初期]]。
{{时间轴
|秃叶季出生=〔[[鹭翅 (雷族)|鹭翅]]、[[兔跃 (雷族)|兔跃]]、[[罂粟曙]]〕{{Efn|name=ageGC}}{{r|gc|a}}、〔[[鹅羽]]、[[月花]]〕{{Efn|name=app}}{{r|gc|a}}
}}
{{Notelist|refs=
{{Efn|name=ageGC|4个月大的小鹅成为学徒时，褐鹿鸣的幼崽还要1个月才会成为学徒；也就是5个月大。}}
{{Efn|name=app|在绿叶季末，受训3个月的鹅爪被牝鹿星要求授予全名；当时月爪才刚受训1个月。}}
}}

=== 18年 ===
请参阅[[时间轴/四族初期|四族初期]]。
{{时间轴
|绿叶季书籍=《[[鹅羽的诅咒]]》{{Efn|name=season}}{{r|gc|5章}}
|绿叶季事件=
* 4个月大的鹅爪成为巫医学徒。{{r|gc|4章}}<!--夏初-->
|绿叶季出生=〔[[母鹿跃]]、[[黑麦秆]]、[[雄鹿跳]]〕{{Efn|name=ageTR}}{{DR|tr|cn=2章|tw=37-38}}
<!---->
|落叶季书籍=《[[鹅羽的诅咒]]》{{Efn|name=season}}{{r|gc|6章}}
|落叶季事件=
* 7个月大的鹅羽获得巫医全名。{{r|gc|6章}}<!--秋初-->
|落叶季出生=〔[[青面]]、[[尖嘴掌|{{LT|Shrewclaw (WC)}}]]〕{{Efn|name=ageTR}}{{DR|tr|cn=1章|tw=19}}、〔[[羽须]]、[[日星]]〕{{r|gc|7章}}
<!---->
|秃叶季书籍=《[[松星的抉择]]》、<br/>《[[鹅羽的诅咒]]》
|秃叶季事件=
* 雷族发生{{Engname|大饥荒|Great Hunger}}。{{r|gc|9章}}
* 小高和小燕雀出生，但后者夭折死去。{{DR|tr|cn=2章|tw=32}}
|秃叶季出生=〔[[纹尾]]、[[一只眼|{{LT|One-eye}}]]〕{{r|gc|8章}}、〔[[斑尾]]、[[褐斑 (雷族)|褐斑]]、[[画眉毛 (雷族)|画眉毛]]〕{{r|gc|8章}}、〔[[小燕雀 (风族)|小燕雀]]、[[高星]]〕{{r|tr}}
|秃叶季死亡=[[兔扑]]{{r|gc|9章}}、[[闪电鼻]]{{r|gc|9章}}、[[荨麻风]]{{r|gc|9章}}、[[牡鹿跃]]{{r|gc|9章}}、[[冬青毛]]{{r|gc|9章}}、[[小燕雀 (风族)|小燕雀]]{{r|tr}}、[[小母鸡|{{LT|Wee Hen (TR)}}]]{{DR|tr|cn=12章|tw=135}}
}}
{{Notelist|refs=
{{Efn|name=season|第5章提到“绿叶季也不能浪费药草”，但第6章已经出现棕色落叶，应是绿叶季末、落叶季初。}}
{{Efn|name=ageTR|雾鼠的幼崽成为学徒时，小高0.5个月大；蕨翅的幼崽比小高大3个月。}}
}}

=== 19年 ===
请参阅[[时间轴/四族初期|四族初期]]。
{{时间轴
|新叶季书籍=《[[松星的抉择]]》、<br/>《[[鹅羽的诅咒]]》、<br/>《[[高星的复仇]]》{{r|gc|10章}}
|新叶季事件=
* 牝鹿星死亡；松星成为雷族族长，并选咕哝脚为副族长。{{r|gc|10章}}{{r|pc|5章}}
* 松星在[[两脚兽地盘]]遇见了[[克莉斯托]]的儿子——[[杰克]]。{{r|pc|5章}}
|新叶季死亡=[[牝鹿星]]{{r|gc|10章}}
<!---->
|绿叶季书籍=《[[高星的复仇]]》、<br/>《[[黄牙的秘密]]》
|绿叶季事件=
* 小坚果、小花楸和小黄出生。{{r|ys}}
* 高爪成为学徒。{{DR|tr|cn=5章|tw=60}}
* 访客拜访风族。{{DR|tr|cn=12章|tw=134}}
* 影族入侵风族营地，蕨翅死亡。{{DR|tr|cn=15章|tw=166}}
* 残爪和焦爪成为学徒。{{r|ys}}
|绿叶季出生=〔[[坚果须]]、[[花楸果]]、[[黄牙]]〕{{r|ys}}、〔[[坏脚]]、[[灰鸽爪]]、[[栗爪 (风族)|栗爪]]〕{{DR|tr|cn=19章|tw=192}}
|绿叶季死亡=[[蕨翅]]{{DR|tr|cn=15章|tw=166}}、[[沙荆]]{{DR|tr|cn=18章|tw=182}}
<!---->
|落叶季书籍=《[[高星的复仇]]》、<br/>《[[黄牙的秘密]]》
|落叶季事件=
* 访客离开风族。{{DR|tr|cn=21章|tw=207}}
* 高尾和{{LT|Shrewclaw (WC)}}成为武士。{{DR|tr|cn=23章|tw=231}}
|落叶季出生=〔[[小鬃毛]]、[[小飞 (风族)|小飞]]、[[小兔子 (风族)|{{LT|Rabbitkit (TS)}}]]、[[鹪鹩飞]]〕<!--秋末-->{{DR|tr|cn=25章|tw=247}}
<!---->
|秃叶季书籍=《[[高星的复仇]]》、<br/>《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》
|秃叶季事件=
* 高尾离开风族寻找[[麻雀 (高星的复仇)|麻雀]]。{{DR|tr|cn=26章|tw=262}}
* 坚果爪、花楸爪和黄爪成为学徒。{{r|ys}}
* 高尾回到风族。{{DR|tr|cn=40章|tw=385}}
* 小橡和{{LT|Stormkit (CP)}}出生。{{r|cp}}
* 影族入侵风族领地，{{LT|Shrewclaw (WC)}}死亡。{{DR|tr|cn=43章|tw=425}}
|秃叶季出生=〔[[橡心]]、[[钩星]]〕{{r|cp}}
|秃叶季死亡=[[银焰]]{{r|ys}}、[[尖嘴掌|{{LT|Shrewclaw (WC)}}]]{{DR|tr|cn=43章|tw=428}}、[[暮水]]{{r|cp}}、[[多米诺]]{{r|cp}}
}}

=== 20年 ===
{{时间轴
|新叶季书籍=《[[高星的复仇]]》、<br/>《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》
|新叶季事件=
* {{LT|Hopkit (WC)}}更名为死爪，并和灰鸽爪、栗爪一起成为学徒。{{DR|tr|cn=44章|tw=435-437}}
* 小蓝和小雪出生。{{r|bp}}
* {{LT|Stormkit (CP)}}摔伤了下巴。{{r|cp}}
* {{LT|Stormkit (CP)}}更名为小钩。{{r|cp}}
* 橡爪成为学徒。{{r|bp}}
* 小钩离开河族并和独行猫同住。{{r|cp}}
|新叶季出生=〔[[蓝星]]、[[雪毛]]〕{{r|bp}}、〔[[泥掌 (风族)|{{LT|Mudclaw}}]]、[[网脚]]〕{{cite}}
<!---->
|绿叶季书籍=《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》
|绿叶季事件=
* 坚果须、花楸果和黄牙成为武士。{{r|ys}}
* 影族和宠物猫发生冲突。{{r|ys}}
* [[黄毛|{{LT|Red (SC)}}]]和[[石头|{{LT|Boulder}}]]加入影族；前者更名为锈爪。{{r|ys}}
* 小钩回到河族。{{r|cp}}
|绿叶季出生=〔[[玫瑰尾]]、[[甜爪]]、[[蓟掌|{{LT|Thistleclaw}}]]〕{{r|bp}}、〔[[金花]]、[[狮心]]〕{{r|bp}}
<!---->
|落叶季书籍=《[[松星的抉择]]》、<br/>《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》
|落叶季事件=
* {{LT|Crookedpaw}}救了小灰和小柳并成为学徒。{{r|cp}}
* 蓝爪和雪爪成为学徒。{{r|bp}}
* 芦苇羽带走小灰和小柳。{{r|cp}}
* 鹅羽预言风族会毁灭雷族；雷族攻击风族，月花被[[鹰心]]杀死。{{r|bp}}
* 松星通过杰克认识了[[珊蒂]]。{{r|pc}}
|落叶季出生=〔[[灰池]]、[[柳风]]〕{{r|cp}}、〔[[云毛]]、[[小小 (黄牙的秘密)|{{LT|Littlekit (SC)}}]]〕{{r|ys}}
|落叶季死亡=[[小小 (黄牙的秘密)|{{LT|Littlekit (SC)}}]]{{r|ys}}、[[月花]]{{r|bp}}
<!---->
|秃叶季书籍=《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》
|秃叶季事件=
* 宠物猫攻击影族，意图“救回”锈爪和{{LT|Boulder}}；哈尔被残皮杀死。{{r|ys}}
* 橡心成为武士。{{r|cp}}
* 黄牙成为巫医学徒。{{r|ys}}
* [[石牙]]退休，残皮成为副族长。{{r|ys}}
* 雷族和河族争夺太阳石，雷族获胜。{{r|bp}}{{r|cp}}
* 雹星袭击风族并带回了小灰和小柳{{r|cp}}
|秃叶季死亡=[[哈尔]]{{r|ys}}
}}

=== 21年 ===
{{时间轴
|新叶季书籍=《[[松星的抉择]]》、<br/>《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》
|新叶季事件=
* 松星认识了珊蒂的两脚兽。{{r|pc}}
* 牝鹿星在梦中警告松星，他未出世的儿子将会有毁灭雷族的力量。{{r|pc}}
* 鹅羽预言蓝爪将成为燃过森林的一团火。{{r|bp}}
* 灰爪和柳爪成为学徒。{{r|cp}}
* 蓝毛、雪毛和钩嘴成为武士。{{r|bp}}{{r|cp}}
|新叶季出生=〔[[蛙跳]]、[[日鱼]]〕{{r|cp}}、〔[[黑掌|{{LT|Blackclaw}}]]、[[天心]]〕{{r|cp}}
<!---->
|绿叶季书籍=《[[松星的抉择]]》、<br/>《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》
|绿叶季事件=
* 河族和平取回太阳石。{{r|bp}}{{r|cp}}
* 亮天和三只幼崽在生产后死亡。{{r|cp}}
* {{LT|Thistleclaw}}因为打退了一条狗而成为武士。{{r|bp}}
* 柳风被两脚兽带走，灰池和钩嘴将她救回。{{r|cp}}
* 牝鹿星持续警告松星关于小虎的事情，最终使他失去继续担任族长的意愿。{{r|pc}}
** 珊蒂被怪兽撞死，松星决定搬到她家成为宠物猫。{{r|pc}}
** 日星成为雷族族长，并选褐斑为副族长。{{r|bp}}
|绿叶季出生=〔[[响肚]]、[[芦苇尾 (河族)|芦苇尾]]、[[莎草溪]]〕{{r|cp}}、〔[[小雾 (雷族)|小雾]]、[[小夜 (雷族)|小夜]]、[[虎星 (预言开始)|虎星]]〕{{r|bp}}、〔[[豹星]]、三只幼崽〕{{r|cp}}、〔[[白风]]〕{{r|bp}}、〔[[纹脸]]、[[霜毛]]〕{{r|bp}}
|绿叶季死亡=〔[[亮天]]、三只幼崽〕{{r|cp}}、[[甜爪]]{{r|bp}}、〔[[小雾 (雷族)|小雾]]、[[小夜 (雷族)|小夜]]〕{{r|bp}}、[[珊蒂]]{{r|pc}}
<!---->
|落叶季书籍=《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》、<br/>《[[长鞭崛起]]》
|落叶季事件=
* 雪毛在驱赶影族巡逻队时被怪兽撞死。{{r|bp}}<!--* 罂粟曙退休。-->
* 虎爪成为学徒。
** [[长鞭|小不点]]闯入雷族领土，被虎爪暴打。{{Efn|name=shBUG}}{{r|bp}}
* [[云毛|云爪]]受了重伤，黄牙持续不懈的照顾他。{{r|ys}}
** 黄牙取得了巫医资格。{{r|ys}}
|落叶季出生=〔[[红尾]]、[[斑叶]]、[[柳带]]〕{{r|bp}}
|落叶季死亡=[[雪毛]]{{r|bp}}
<!---->
|秃叶季书籍=《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》、<br/>《[[斑叶的心声]]》
|秃叶季事件=
* 黑爪、天爪、响爪、莎草爪、芦苇爪、豹爪成为学徒。{{r|cp}}
* 雷族和平取回太阳石。{{r|cp}}
* 黄牙生下了{{LT|Brokenkit}}，并将他交给蜥蜴条扶养。{{r|ys}}
* 在{{LT|Thistleclaw}}称赞{{LT|Spottedkit (BP)}}可以成为很棒的巫医后，{{LT|Spottedkit (BP)}}展现出了想要成为武士的野心。{{r|sh}}
|秃叶季出生=〔[[鹿脚]]、[[奔鼻]]、[[缠果]]〕{{r|ys}}、〔[[断星]]、[[小祈]]、[[小愿]]〕{{r|ys}}
|秃叶季死亡=[[小祈]]{{r|ys}}、[[小愿]]{{r|ys}}
}}
{{Notelist|
{{Efn|name=shBUG|在《斑叶的心声》，当上学徒的{{LT|Spottedpaw (BP)}}目睹了此事件，尽管在《蓝星的预言》时间线上是不可能的。<!--待确认：她出生还是没出生？-->}}
}}

=== 22年 ===
{{时间轴
|新叶季书籍=《[[黄牙的秘密]]》、<br/>《[[斑叶的心声]]》
|新叶季事件=
* 圣须死亡；黄牙成为影族巫医。{{r|ys}}
* {{LT|Spottedpaw (BP)}}、红爪和柳爪成为学徒。{{r|sh}}
* {{LT|Spottedpaw (BP)}}从树上掉下来受伤。{{r|sh}}
** 因为待在巫医窝学习了许多药草用法，但之后依然返回武士训练。{{r|sh}}<!--鹅羽退休了…？-->
* {{LT|Thistleclaw}}和{{LT|Spottedpaw (BP)}}开始出现暧昧。{{r|sh}}
* {{LT|Thistleclaw}}带{{LT|Spottedpaw (BP)}}到黑森林。{{r|sh}}
* {{LT|Spottedpaw (BP)}}发现暴尾生病，因此羽须问她想不想成为巫医学徒。{{r|sh}}
** {{LT|Spottedpaw (BP)}}希望{{LT|Thistleclaw}}为了她而离开黑森林，但遭到拒绝。
* {{LT|Spottedpaw (BP)}}决定接受巫医训练。{{Efn|name=shBUG_gf}}{{r|sh}}
|新叶季死亡=[[圣须]]{{r|ys}}
<!---->
|绿叶季书籍=《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》
|绿叶季事件=
* 雨花被狗撞到河床上，头部受到重击后死去。{{r|cp}}
* 泥毛和蝰蛇牙为了太阳石单挑，泥毛获胜。{{r|cp}}
** 泥毛决定成为巫医，同时贝壳心也决定退休。{{r|cp}}
** 钩嘴成为河族副族长。{{r|cp}}
* 杉星死亡；残星成为影族族长，并选狐心为副族长。{{r|ys}}
** {{LT|Brokentail}}成为武士，尽管他只受了5个月的训练。{{r|ys}}
|绿叶季死亡=[[雨花 (河族)|雨花]]{{r|cp}}、[[杉星]]{{r|ys}}
<!---->
|落叶季书籍=《[[钩星的承诺]]》、<br/>《[[蓝星的预言]]》、<br/>《[[斑叶的心声]]》
|落叶季事件=
* 白风和{{LT|Tigerclaw}}成为武士。{{Efn|name=shBUG_tc}}{{Efn|name=shBUG_bf}}{{r|sh}}
* 日星到河族营地和平收回太阳石。{{r|sh}}
* 蓝毛和橡心在四棵树会面。{{r|bp}}
|落叶季出生=〔[[鼠毛]]、[[奔风|{{LT|Runningwind (TC)}}]]〕{{r|bp}}
<!---->
|秃叶季书籍=《[[黄牙的秘密]]》、<br/>《[[蓝星的预言]]》、<br/>《[[斑叶的心声]]》
|秃叶季事件=
* 雹星死亡；钩星成为河族族长，并选木毛为副族长。{{r|cp}}
* {{LT|Thistleclaw}}在边界打伤了橡心。{{r|bp}}{{r|cp}}
* 鹅羽退休并成为长老；羽须成为雷族巫医。{{r|bp}}
* 蓝毛将幼崽交给橡心。{{r|bp}}{{r|cp}}{{r|sh}}
* 狐心死亡；云毛成为影族副族长。{{r|ys}}
|秃叶季出生=〔[[小斑 (钩星的承诺)|{{LT|Splashkit (CP)}}]]、[[小晨]]{{r|cp}}、〔[[石毛 (河族)|石毛]]、[[雾星]]、[[小苔藓|{{LT|Mosskit (TC)}}]]〕{{r|bp}}
|秃叶季死亡=〔[[小斑 (钩星的承诺)|{{LT|Splashkit (CP)}}]]、[[小晨]]〕{{r|cp}}、[[小苔藓|{{LT|Mosskit (TC)}}]]{{r|bp}}、[[雹星]]{{r|cp}}、[[狐心]]{{r|ys}}
}}
{{Notelist|
{{Efn|name=shBUG_gf|根据《蓝星的预言》，鹅羽还没退休，因此{{LT|Spottedpaw (BP)}}不能成为羽须的学徒。}}
{{Efn|name=shBUG_tc|在《斑叶的心声》中，白风和{{LT|Tigerclaw}}一起成为武士；但在《蓝星的预言》中是分开的。}}
{{Efn|name=shBUG_bf|在《斑叶的心声》中，蓝毛在白风成为武士时就已经怀孕；但在《蓝星的预言》，白风成为武士并去了河族营地后，蓝毛才和橡心幽会。}}
}}

=== 23年 ===
{{时间轴
|新叶季书籍=《[[黄牙的秘密]]》
|新叶季事件=
* 奔鼻获得全名。{{r|ys}}
|新叶季死亡=[[鹅羽]]<!--{{Efn|name=ysBUG_sk}}-->{{r|ys}}
<!---->
|绿叶季事件={{Coming soon}}
<!---->
|落叶季事件={{Coming soon}}
<!---->
|秃叶季事件={{Coming soon}}
|秃叶季出生=[[长尾]]{{Efn|name=longtail}}{{r|os1|3章}}{{r|code}}
}}
{{Notelist|refs=
<!--{{Efn|name=ysBUG_sk|羽须提到鹅羽死亡，以及“{{LT|Spottedkit (BP)}}”可以期待，但她早已超过年纪了。}}-->
{{Efn|name=longtail|在《[[呼唤野性]]》提到长尾刚完成武士训练2个月；此外在《[[族群的守则]]》也能证实他在拉斯特加入前的秃叶季就取得武士名。}}
}}

=== 24年 ===
{{时间轴
|新叶季事件={{Coming soon}}
<!---->
|绿叶季书籍=《[[黄牙的秘密]]》、<br/>《[[钩星的承诺]]》
|绿叶季事件=
* 云毛死亡；{{LT|Brokentail}}成为影族副族长。
|绿叶季出生=〔[[小鱼 (钩星的承诺)|{{LT|Minnowkit}}]]、[[银溪]]、[[小柳 (钩星的承诺)|小柳]]〕{{r|cp}}、〔[[曙云]]、[[田鼠爪 (影族)|田鼠爪]]、[[苔藓爪|{{LT|Mosspaw (SC)}}]]〕{{r|ys}}
|绿叶季死亡=[[柳风]]{{r|cp}}、〔[[小鱼 (钩星的承诺)|{{LT|Minnowkit}}]]、[[小柳 (钩星的承诺)|小柳]]〕{{r|cp}}、[[云毛]]{{r|ys}}
<!---->
|落叶季书籍=《[[黄牙的秘密]]》
|落叶季事件=
* 残星死亡；断星成为影族族长，并选黑脚为副族长。{{r|cp}}
* 断星开始训练年纪不足六个月的幼崽。{{r|cp}}
|落叶季出生=〔[[尘毛]]、[[乌爪]]〕{{r|os1}}{{cite}}、〔[[沙风]]〕{{r|os1}}、〔[[灰条]]〕{{r|os1}}、〔[[火星]]、[[公主]]〕{{r|os1}}、〔[[棕爪]]、[[小云]]、[[湿脚]]〕{{r|ys}}、〔[[獾牙]]〕{{r|ys}}
|落叶季死亡=[[苔藓爪|{{LT|Mosspaw (SC)}}]]{{r|ys}}、[[残星]]{{r|ys}}、[[石牙]]{{r|ys}}
<!---->
|秃叶季事件={{Coming soon}}
|秃叶季死亡=[[罂粟曙]]{{r|code}}
}}

== 现代 ==
=== 25年 ===
{{时间轴
|新叶季书籍=《[[黄牙的秘密]]》、<br/>《[[蓝星的预言]]》、<br/>《[[呼唤野性]]》
|新叶季事件=
* 拉斯特加入雷族，并更名为火爪。{{r|os1}}
* 雷族和河族争夺太阳石。{{r|os1}}
** 橡心被石头压死，{{cite}}红尾被{{LT|Tigerclaw}}杀死。{{cite}}
** 狮心成为雷族副族长；{{r|os1}}豹毛成为河族副族长。{{r|os2}}
|新叶季出生=〔[[迅爪 (雷族)|{{LT|Swiftpaw (TC)}}]]〕{{r|os1}}、〔[[蕨毛]]、[[亮心]]、[[炭毛]]、[[刺掌|{{LT|Thornclaw}}]]〕{{r|os1}}、〔[[小金盏花]]、[[小薄荷 (影族)|小薄荷]]〕{{r|ys}}
|新叶季死亡=[[橡心]]{{r|os1}}、[[红尾]]{{r|os1}}
<!---->
|绿叶季书籍=《[[黄牙的秘密]]》、<br/>《[[呼唤野性]]》
|绿叶季事件=
* 断星将风族赶出高地。{{r|os1}}{{r|ys}}
* 黄牙被断星逐出；奔鼻成为影族巫医。{{r|ys}}
** 黄牙遇到了火爪，并成为雷族囚犯。{{r|os1}}
* 影族攻击雷族，狮心死亡。{{r|os1}}
** {{LT|Tigerclaw}}成为雷族副族长。{{r|os1}}
** 黄牙加入雷族。{{r|os1}}
* 斑叶被爪脸杀死。{{r|os1}}
** 乌爪离开雷族并加入巴利。{{r|os1}}
** 断星和其党羽被逐出影族。{{r|os1}}
** 火心和灰条成为武士；黄牙成为雷族巫医。{{r|os1}}
|绿叶季出生=〔[[蜡毛]]、[[香薇云]]〕{{r|os1}}、〔[[鼠痕]]、[[雪鸟]]〕{{r|ageOfSnowbirdAndRatscar}}
|绿叶季死亡=[[石掌|{{LT|Stoneclaw}}]]{{r|secrets}}、[[獾牙]]{{r|ys}}、〔[[小金盏花]]、[[小薄荷 (影族)|小薄荷]]〕{{r|ys}}、[[狮心]]{{r|os1}}、[[玫瑰尾]]{{r|os1}}、[[斑叶]]{{r|os1}}
<!---->
|落叶季书籍=《[[寒冰烈火]]》
|落叶季事件=
* 火心和灰条带回了风族。{{r|os2}}
* 夜星成为影族族长，并选{{LT|Cinderfur}}为副族长。{{r|os2}}
* 炭爪和蕨爪成为火心和灰条的学徒。{{r|os2}}
* 公主的幼崽加入了雷族，并被命名为{{LT|Cloudkit (TPB)}}。{{r|os2}}
* 炭爪被怪兽撞伤。{{r|os2}}
|落叶季出生=[[云尾]]{{r|os2}}、[[金雀花爪 (风族)|金雀花爪]]{{r|os2}}
|落叶季死亡=[[白掌|{{LT|Whiteclaw}}]]{{r|os2}}
<!---->
|秃叶季书籍=《[[寒冰烈火]]》、<br/>《[[疑云重重]]》
|秃叶季事件=
* 灰条开始和银溪见面。{{r|os2}}{{r|cpm}}
* 雷族爆发绿咳症。{{r|os2}}
* 断星带泼皮猫攻击雷族。{{r|os2}}
* 河族和影族结盟攻击风族，但被雷族协防成功。{{r|os2}}
|秃叶季死亡=[[爪脸]]{{r|os2}}
}}

=== 26年 ===
{{时间轴
|新叶季书籍=《[[疑云重重]]》、<br/>《[[虎掌的愤怒]]》
|新叶季事件=
* {{LT|Tigerclaw}}的幼崽－黑莓崽和{{LT|Tawnykit (SC)}}出生。{{r|os3}}
* 云爪成为火心的学徒。{{r|os3}}
* 银溪在生产时死亡。{{r|os3}}
** {{LT|Stormkit (TPB)}}和小羽出生。{{r|os3}}
* {{LT|Tigerclaw}}被放逐；火心成为雷族副族长。{{r|os3}}{{r|tf}}
* 灰条带幼崽加入了河族。{{r|os3}}
|新叶季出生=〔[[黑莓星]]、[[褐皮]]〕{{r|os3}}、〔[[暴毛]]、[[羽尾]]〕{{r|os3}}
|新叶季死亡=[[银溪]]{{r|os3}}、[[断星]]{{r|os3}}
<!---->
|绿叶季书籍=《[[风起云涌]]》、<br/>《[[虎掌的愤怒]]》
|绿叶季事件=
* 云爪偷吃两脚兽食物，不久后被强制带走。{{r|os4}}
** 火心、沙风、乌爪将他救回。{{r|os4}}
* 蓝星开始出现精神问题。{{r|os4}}
* 雷族发生森林大火。{{r|os4}}
** 黄牙死亡；炭毛成为雷族巫医。{{r|os4}}
* 虎星成为影族族长，并选黑脚为副族长。{{r|os4}}{{r|tf}}
|绿叶季出生=〔[[雨须]]、[[烟毛|{{LT|Sootfur (TC)}}]]、[[栗尾]]〕{{r|os4}}
|绿叶季死亡=[[奔风|{{LT|Runningwind (TC)}}]]{{r|os4}}{{r|tf}}、[[团毛]]{{r|os4}}、[[半尾]]{{r|os4}}、[[黄牙]]{{r|os4}}、[[白喉]]{{r|os4}}、[[夜星]]{{r|os4}}
<!---->
|落叶季书籍=《[[险路惊魂]]》、<br/>《[[进入森林]]》、<br/>《[[逃出森林]]》
|落叶季事件=
* 钩星死亡；豹星成为河族族长，并选石毛为副族长。{{r|os5}}
* 豹星意图取回太阳石，但遭到灰条阻挠；灰条被逐出河族。{{r|os5}}
** 灰条重新加入雷族。{{r|os5}}
* 虎星邀请莎夏加入影族。{{r|ts1}}
** 莎夏发现了虎星的残忍计划，逃离了森林。{{r|ts1}}
* 虎星意图诱使狗群攻击雷族。{{r|os5}}
** 蓝星将狗群首领拖入峡谷，但自己也牺牲了。{{r|os5}}
|落叶季死亡=[[钩星|{{LT|Runningwind (TC)}}]]{{r|os5}}、[[灰池]]{{r|os5}}、[[迅爪 (雷族)|{{LT|Swiftpaw (TC)}}]]{{r|os5}}、[[纹脸]]{{r|os5}}、[[蓝星]]{{r|os5}}
<!---->
|秃叶季书籍=《[[力挽狂澜]]》、<br/>《[[长鞭崛起]]》、<br/>《[[逃出森林]]》、<br/>《[[返回族群]]》
|秃叶季事件=
* 火星成为雷族族长，并选白风为副族长。{{r|os6}}
* 虎星联合豹星创立了虎族。{{r|os6}}
* 黑条意图毒杀{{LT|Sorrelkit (TPB)}}，被雷族放逐后加入了虎族。{{r|os6}}
* 石毛被黑脚和黑条杀死。{{r|os6}}
* 虎星联合血族意图逼风族和雷族就范，但被长鞭杀死。{{r|os6}}
* 四族和血族发生战斗。{{r|os6}}
** 白风战死，灰条成为雷族副族长。{{r|os6}}
** 长鞭被火星杀死，血族四散逃走。{{r|os6}}
* 雾脚成为河族副族长。{{r|os6}}
* 坏脚退休，{{LT|Mudclaw}}成为风族副族长。{{r|fq}}
* 黑星成为影族族长，并选黄毛为副族长。{{r|os6}}{{r|fq}}
* 莎夏生下了蝌蚪、飞鹰和{{LT|Moth (TS)}}。{{r|ts3}}
* 蝌蚪溺亡。{{r|ts3}}
|秃叶季出生=〔[[蝌蚪]]、[[鹰霜]]、[[蛾翅]]〕{{r|ts3}}
|秃叶季死亡=[[金雀花爪 (风族)|金雀花爪]]{{r|os6}}、[[石毛 (河族)|石毛]]{{r|os6}}、[[虎星 (预言开始)|虎星]]{{r|os6}}、[[白风]]{{r|os6}}、[[壮骨]]{{r|os6}}、[[黑条]]{{r|os6}}、[[长鞭]]{{r|os6}}、[[蝌蚪]]{{r|ts3}}
}}

=== 27年 ===
{{时间轴
|新叶季书籍=《[[返回族群]]》
|新叶季事件=
* 莎夏、飞鹰和{{LT|Moth (TS)}}加入河族。{{r|ts3}}
* 莎夏离开河族。{{r|ts3}}
|新叶季出生=〔[[蛛足]]、[[鼩鼱爪]]〕{{r|fq}}
<!---->
|绿叶季书籍=《[[火星的探索]]》
|绿叶季事件=
* 黑莓掌和褐皮成为武士。{{r|fq}}
* 火星和沙风出发重建天族。{{r|fq}}
|绿叶季出生=〔[[鸦羽]]、两只幼崽〕{{r|fq}}、〔[[白翅]]〕{{r|fq}}
|绿叶季死亡=[[柳带]]{{r|fq}}
<!---->
|落叶季书籍=《[[火星的探索]]》
|落叶季事件=
* 天族重建。{{r|fq}}
* 叶星成为天族族长，并选{{LT|Sharpclaw}}为副族长。{{r|fq}}
* {{LT|Hawkpaw}}和蛾爪成为河族学徒。{{r|ts3}}
|落叶季出生=〔[[薄荷毛 (天族)|薄荷毛]]、[[鼠尾草鼻]]〕{{r|fq}}
|落叶季死亡=[[护天]]{{r|fq}}、[[雨毛 (天族)|雨毛]]{{r|fq}}
<!---->
|秃叶季书籍=《[[火星的探索]]》、<br/>《[[和平破碎]]》
|秃叶季事件=
* 火星的幼崽出生。{{r|fq}}
* 乌爪和巴利被泼皮猫赶出农场。{{r|rp1}}
|秃叶季出生=〔[[叶池]]、[[松鼠飞]]〕{{r|fq}}
}}

=== 28年 ===
{{时间轴
|新叶季书籍=《[[族群救星]]》、<br/>《[[武士之心]]》、<br/>《[[天族外传]]》
|新叶季事件=
* 血族残党袭击雷族。{{r|rp2}}
* 乌爪和巴利回到农场。{{r|rp3}}
* 叶星尝试让天族生存下去。{{r|sd}}
|新叶季死亡=[[红毛|{{LT|Red (SD)}}]]{{r|sd}}
<!---->
|绿叶季书籍=《[[午夜追踪]]》
|绿叶季事件=
* 六猫出发寻找[[太阳沉没之地]]。{{r|np1}}
|绿叶季出生=〔[[桦落]]、[[小冬青 (新预言)|小冬青]]、[[小叶松 (新预言)|小叶松]]〕{{r|np1}}
<!---->
|落叶季书籍=《[[午夜追踪]]》、<br/>《[[新月危机]]》
|落叶季事件=
* 六猫踏上归途，但被急水部落扣留。{{r|np2}}
* 羽尾杀死了尖牙，但也牺牲了。{{r|np2}}
* 两脚兽开始摧毁森林。{{r|np2}}
|落叶季出生=〔[[柳光]]〕{{cite}}
|落叶季死亡=[[斑尾]]{{r|np2}}、[[羽尾]]{{r|np2}}、[[小叶松 (新预言)|小叶松]]{{r|np2}}
<!---->
|秃叶季书籍=《[[重现家园]]》、<br/>《[[紧急救援]]》、<br/>《[[星光指路]]》、<br/>《[[超越规则]]》、<br/>《[[武士失踪]]》
|秃叶季事件=
* 随着森林被摧毁，族群开始受难。{{r|np3}}
* 灰条被抓走，并认识了米莉。{{r|lw1}}
* 族群出发前往新家，并在湖边住下。{{r|np3}}
** 高星将风族副族长从{{LT|Mudclaw}}换成一根须。{{r|np4}}
** 高星死亡；一根须成为风族族长，并选灰脚为副族长。{{r|np4}}
* 叶爪找到月池，并获得全名－叶池。{{r|np4}}
* {{LT|Mudclaw}}发动叛变，但被树砸死。{{r|np4}}
** 一星取得九命和圣名。{{r|np4}}
* 一只名为哈利的宠物猫协助叶星逃出两脚兽的家。{{r|ss1}}
** 哈利宣布他的真名是日神，并要求加入天族。{{r|ss1}}
* 洪水袭击天族峡谷。{{r|ss2}}
|秃叶季出生=〔[[莓鼻]]、[[鼠须]]、[[榛尾]]〕{{cite}}、〔[[火蕨]]、[[哈利溪]]、[[风心]]〕{{cite}}
|秃叶季死亡=[[小冬青 (新预言)|小冬青]]{{r|np3}}、[[泥毛]]{{r|np3}}、[[高星]]{{r|np4}}、[[泥掌 (风族)|{{LT|Mudclaw}}]]{{r|np4}}、〔[[纹尾]]、[[霜毛]]、[[荫皮 (预言开始)]]、[[响肚]]〕{{cite}}、[[苔藓毛]]{{cite}}
}}

=== 29年 ===
{{时间轴
|新叶季书籍=《[[黄昏战争]]》、<br/>《[[洪水过后]]》、<br/>《[[日落和平]]》、<br/>《[[武士失踪]]》
|新叶季事件=
* 虎星开始在梦中拜访儿子们。{{r|np5}}
* 叶池和鸦羽私奔，但稍后回到了各自的族群。{{r|np5}}
* 獾群攻击雷族营地，但在风族的支援下撤退了。{{r|np5}}
* 日神被发现偷藏叶星的幼崽，以换取“救回”他们的机会来当上武士。{{r|ss3}}
** 日神被天族放逐；比利风决定不再回到两脚兽巢穴。{{r|ss3}}
* 火星宣布灰条已死，并选黑莓掌为雷族副族长。{{r|np6}}
* 黑莓掌反抗虎星，杀死了鹰霜并救了火星。{{r|np6}}
|新叶季出生=〔[[炭心]]、[[蜜蕨]]、[[痣爪|{{LT|Molepaw (NP)}}]]、[[罂粟霜]]〕{{r|np5}}
|新叶季死亡=<!--[[春藤尾]]{{r|np5}}、-->[[炭毛]]{{r|np5}}、[[烟毛|{{LT|Sootfur (TC)}}]]{{r|np5}}、[[鹰霜]]{{r|np6}}
<!---->
|绿叶季书籍=《[[叶池的希望]]》、<br/>《[[武士避难]]》
|绿叶季事件=
* 灰条和米莉开始了寻找族群的旅程。{{r|lw2}}
|绿叶季出生=〔[[冬青叶]]、[[狮焰]]、[[松鸦羽]]〕{{Efn|name=kitsOfLeafpool}}{{r|lw}}、〔[[风皮]]、两只幼崽〕{{r|as}}{{r|ct}}
<!---->
|落叶季书籍=《[[武士避难]]》、<br/>《[[武士回归]]》
|落叶季事件=
* 灰条和米莉找到了森林里被遗弃的营地。{{r|lw2}}
|落叶季死亡=[[金花]]{{cite}}、[[雨须]]{{cite}}
<!---->
|秃叶季书籍=《[[预视力量]]》、<br/>《[[武士回归]]》
|秃叶季事件=
* 冬青爪、狮爪和松鸦爪成为学徒。{{r|po1}}
* 灰条和米莉找到了湖区并加入雷族。{{r|po1}}{{r|lw3}}
|秃叶季出生=〔[[狐步]]、[[冰云]]〕{{r|po1}}
}}
{{Notelist|refs=
{{Efn|name=kitsOfLeafpool|尽管书中多次提到冬狮松是在寒冷的下雪天出生的，但在时间轴上不可能成立；无论是叶池的孕期，或是他们当上学徒的时刻。}}
}}

=== 30年 ===
{{时间轴
|新叶季书籍=《[[暗河汹涌]]》、<br/>《[[驱逐之战]]》
|新叶季事件=
* 雷族和风族领地下的隧道被发现。{{r|po2}}
* 褐皮生下了{{LT|Dawnkit (SC)}}、{{LT|Flamekit (SC)}}和小虎。{{r|po2}}
* 松鸦爪在梦中见到了远古猫。{{r|po2}}
|新叶季出生=〔[[曙皮]]、[[焰尾]]、[[虎星 (暗影幻象)|虎星]]〕{{r|po2}}
<!---->
|绿叶季书籍=《[[驱逐之战]]》、<br/>《[[天蚀遮月]]》
|绿叶季事件=
* 族群猫协助部落猫击败了泼皮猫。{{r|po3}}
|绿叶季出生=〔[[玫瑰瓣]]、[[蟾步]]〕{{cite}}、〔[[莓心]]、[[苜蓿足]]、[[巴斯特|涟尾]]〕{{r|po4}}{{r|kitsOfSnowBirdQ}}{{r|kitsOfSnowBirdA}}
<!---->
|落叶季书籍=《[[天蚀遮月]]》、<br/>《[[暗夜长影]]》
|落叶季事件=
* 风族和河族结盟攻击雷族，影族协防；松鼠飞受到重伤。{{r|po4}}
* 影族被日神影响，抛弃了星族信仰和武士守则。{{r|po4}}
* 冬青叶和狮焰成为武士。{{r|po4}}
* 雷族爆发绿咳症。{{r|po5}}
* 松鸦羽获得全名。{{r|po5}}
* 大火肆虐雷族。{{r|po5}}
* 蜡毛被发现死在风族和雷族的边界。{{r|po5}}
|落叶季出生=〔[[黄蜂条]]、[[梅花落]]、[[荆棘光]]〕{{cite}}
|落叶季死亡=[[蜡毛]]{{r|po5}}
<!---->
|秃叶季书籍=《[[拂晓之光]]》、<br/>《[[冬青叶的故事]]》、<br/>《[[族群决定]]》
|秃叶季事件=
* 雷族找回了日神；波弟加入雷族。{{r|po6}}
* 在森林大会上，所有猫都知道冬狮松是叶池的幼崽。{{r|po6}}
* 叶池被剥夺巫医资格，松鸦羽成为雷族巫医。{{r|po6}}
* 白翅生下了小鸽和小常春藤。{{r|po6}}
|秃叶季出生=〔[[鸽翅]]、[[藤池]]〕{{r|po6}}
|秃叶季死亡=[[蜜蕨]]{{r|po6}}
}}

=== 31年 ===
{{时间轴
|新叶季书籍=《[[冬青叶的故事]]》
|新叶季事件={{Coming soon}}
<!---->
|绿叶季书籍=《[[第四学徒]]》
|绿叶季事件=
* 族群饱受旱灾之苦。{{r|om1}}
* 鸽爪和常春藤爪成为学徒。{{r|om1}}
* 族群派出联合巡逻队前往水源处。{{r|om1}}
|绿叶季出生=〔[[鼹鼠须|{{LT|Molewhisker (OM)}}]]、[[樱桃落]]〕{{r|om1}}
|绿叶季死亡=[[涟尾 (河族)|涟尾]]{{r|om2}}、〔[[黑掌|{{LT|Blackclaw}}]]、[[曙花]]、[[田鼠齿]]〕{{r|om2}}
<!---->
|落叶季书籍=《[[战声渐近]]》、<br/>《[[雾星的征兆]]》、<br/>《[[乌爪的告别]]》、<br>《[[冬青叶的故事]]》
|落叶季事件=
* 豹星死亡；雾星成为河族族长，并选芦苇须为副族长。{{r|mo}}
* 藤池开始在黑森林训练。{{r|om1}}
* 一棵树砸进雷族营地。{{r|om2}}
* 在虎星的煽动下，雷族和影族爆发领土战争。{{r|om2}}
|落叶季死亡=[[豹星]]{{r|om2}}、[[长尾]]{{r|om2}}、[[黄毛]]{{r|om2}}
<!---->
|秃叶季书籍=《[[暗夜密语]]》、<br/>《[[月光印记]]》、<br/>《[[乌爪的告别]]》、<br>《[[冬青叶的故事]]》
|秃叶季事件=
* 星族告诉巫医们每个族群都必须独立。{{r|om3}}
* 藤池得知了黑森林的真正目的并同意成为一名间谍。{{r|om3}}
* 焰尾掉进了冰封的湖里。{{r|om3}}
** 松鸦羽没能救他。{{r|om3}}
* 一支雷族巡逻队应松鸦羽的请求前往山区。{{r|om4}}
|秃叶季出生=〔[[雾云]]、[[小露珠 (影族)|小露珠]]、[[雀尾]]〕{{r|om3}}
|秃叶季死亡=[[焰尾]]{{r|om3}}、[[蚁毛 (风族)|{{LT|Antpelt}}]]{{r|om4}}
}}

=== 32年 ===
{{时间轴
|新叶季书籍=《[[月光印记]]》、<br>《[[武士归来]]》、<br/>《[[乌爪的告别]]》、<br>《[[冬青叶的故事]]》
|新叶季事件=
* 松鸦羽任命了尖石巫师的继任者，从而拯救了急水部落。{{r|om4}}
* 松鸦羽收到了“三个必须成为四个，与永远的黑暗作战”的预言。{{r|om4}}
* 日神回归雷族，并最初被认为从一只狐狸那里救了樱桃落和鼹鼠须。{{r|om5}}
* 乌爪、莱利、贝拉和巴利踏上寻找天族的旅程。{{r|rf}}
* 莱利爪和贝拉爪成为天族学徒。{{r|rf}}
* 乌爪死亡并加入星族。{{r|rf}}
|新叶季出生=〔[[百合心]]、[[种子爪]]〕{{r|om5}}
|新叶季死亡=[[乌爪]]{{r|rf}}、[[蚁毛 (风族)|{{LT|Antpelt}}]]{{r|om4}}
<!---->
|绿叶季书籍=《[[武士归来]]》、<br/>《[[群星之战]]》、<br>《[[冬青叶的故事]]》
|绿叶季事件=
* 冬青叶回归雷族，并承认自己杀了蜡毛。{{r|om5}}
* 曙皮在森林大会上指控松鸦羽谋杀了焰尾。{{r|om5}}
** 松鸦羽因此被停职。{{r|om5}}
* 在日神的煽动下，雷族和风族爆发地道战争。{{r|om5}}
** 但冬青叶威胁他要不永远的离开，要不被杀死。{{r|om5}}
<!---->
|落叶季书籍=《[[群星之战]]》、<br>《[[鸽翅的沉默]]》
|落叶季事件=
* 焰尾告诉巫医们松鸦羽并没有杀死他。{{r|om6}}
* 松鸦羽和其他巫医们团结了星族。{{r|om6}}
* 火星被发现是预言中的第四只猫。{{r|om6}}
* 黑森林对抗族群猫的群星之战爆发。{{r|om6}}
** 星族猫、远古猫和午夜前来助阵。{{r|om6}}
** 族群猫获胜。{{r|om6}}
* 火星死亡；黑莓星成为雷族族长，并选松鼠飞为副族长。{{r|om6}}
* 灰脚死亡；兔泉成为风族副族长。{{r|bs}}
* 三力量失去特殊能力。{{r|ds}}
|落叶季出生=〔[[琥珀月]]、[[雪丛]]、[[露珠鼻]]〕{{r|om6}}
|落叶季死亡=〔[[甲虫须]]、[[火星]]、[[冬青叶]]、[[鼠毛]]、[[香薇云]]、[[栗尾]]、[[狐步]]、[[断星]]{{Efn|name=spiritdeath}}、[[细尾]]{{Efn|name=spiritdeath}}、[[斑叶]]{{Efn|name=spiritdeath}}、[[虎星 (预言开始)|虎星]]{{Efn|name=spiritdeath}}、[[鹰霜]]{{Efn|name=spiritdeath}}〕{{r|om6}}、[[空飞]]{{r|ds}}、〔[[斑鼻 (河族)|斑鼻]]、[[裂耳]]、[[八哥翅]]、[[灰脚]]、[[枭须]]、[[碎尾 (黑莓星的风暴)|碎尾]]、[[蓟心]]、[[苹果毛 (新预言)|苹果毛]]、[[杉心]]、[[橄榄鼻]]、[[红柳]]、[[鼩足]]、[[燕尾 (风族)|燕尾]]、[[高罂]]、[[蟾足]]、[[小鼬鼠]]〕{{r|bs}}、〔[[圆石毛]]、[[网脚]]、[[日光]]、[[鳟溪]]〕{{r|deathOfBouldfurTroutstreamSunstrikeWebfoot}}
<!---->
|秃叶季书籍=《[[鸽翅的沉默]]》、<br>《[[鸦羽的拷问]]》
|秃叶季事件=
* 绿咳症肆虐雷族。{{r|ds}}
* 短尾鼬住进了地道，风族和雷族因此受到了威胁。{{r|ct}}
* 夜云失踪。{{r|ct}}
** 夜云从两脚兽巢穴中被救了出来。{{r|ct}}
* 雷族与风族一起赶走了短尾鼬。{{r|ct}}
* 一星失去了一条命。{{r|ct}}
|秃叶季出生=〔[[阿树]]、[[寒冰 (姐妹会)|寒冰]]、[[日升]]〕{{r|tsr|1章}}、[[溪流]]{{r|tsr|1章}}
|秃叶季死亡=〔[[冰云]]、[[榛尾]]、[[蟾步]]〕{{r|bs|11}}
}}

{{Notelist|refs=
{{Efn|name=spiritdeath|魂魄消散。}}
}}

=== 33年 ===
{{时间轴
|新叶季书籍=《[[黑莓星的风暴]]》、<br/>《[[阿树的根源]]》
|新叶季事件=
* 洪水袭击族群领土，导致他们临时转移营地。{{r|bs}}
* 黑星被淹死；花楸星成为影族族长，并选乌霜为副族长。{{r|bs}}
* 雷族协助影族击退獾群，尘毛战死。{{r|bs}}
* 族群同意追加一条关于“必要时合作协助其他族群生存下去”的守则。{{r|bs}}
|新叶季出生=〔[[蜂鼻]]、[[小风铃]]{{Unofficial}}、[[蓍叶]]〕{{DR|bs|<!--5章-->|62}}{{r|kitsOfSnowBirdQ}}{{r|bluebellkit}}、〔[[蕨皮 (河族)|蕨皮]]、[[松鸦掌|{{LT|Jayclaw}}]]、[[枭鼻]]〕{{DR|bs|<!--5章-->|62}}、〔[[香薇歌]]、[[冬青簇]]、[[栗条]]〕{{r|bsm}}
|新叶季死亡=[[公主]]{{r|deathOfPrincess}}、[[黑星]]{{r|bs}}、[[本尼]]{{r|bs}}、[[种子爪]]{{r|bs}}、[[尘毛]]{{r|bs}}、〔[[草皮]]、[[卵石足]]〕{{r|bs}}、[[溪流]]{{r|tsr|2章}}<!--、〔[[烟足]]、[[白水]]〕{{r|deathOfSmokefootAndWhitewater}}-->
<!---->
|落叶季书籍=《[[黑莓星的风暴]]》
|落叶季事件=
* 狮焰和炭心的幼崽成为学徒。{{r|bsm}}
* 松鼠飞发现自己怀孕。{{r|bsm}}
|落叶季出生=〔[[卷爪]]、[[躁片]]、[[小喀嚓]]〕{{r|hj}}
|落叶季死亡=[[蛛足]]{{r|vs2}}
<!---->
|秃叶季事件=
* 松鼠飞生下了黑莓星的幼崽。{{r|vs1|a}}
|秃叶季出生=〔[[赤杨心]]、[[烁皮]]、[[小蒲公英]]、[[小杜松]]〕{{r|vs1}}、[[松针尾]]{{cite}}
|秃叶季死亡=[[小杜松]]{{r|vs1}}
}}

=== 34年 ===
{{时间轴
|新叶季书籍=《[[鹰翅的旅程]]》
|新叶季事件=
* 天族被告知必须寻找“火的残留物”；部分猫认为必须要找到雷族和火星。{{r|hj}}
* 天族学徒被困在一场大火中，暮爪被杀。{{r|hj}}
* 一只名叫暗尾的泼皮猫告诉他们前往湖区的方式。{{r|hj}}
** 比利风在旅途被獾杀死，任务失败。{{r|hj}}
* 一群浣熊攻击了天族。{{r|hj}}
* 天族遭到暗尾的泼皮猫袭击并被逐出峡谷，前往湖区寻找新的领地。{{r|hj}}
** {{LT|Sharpclaw}}死亡，黄蜂须成为天族副族长。{{r|hj}}
|新叶季死亡=[[小蒲公英]]{{r|vs1}}、〔[[暮爪]]、[[比利风]]、[[蜜尾]]、[[跳火]]、[[斑脚]]、[[锐掌|{{LT|Sharpclaw}}]]、[[风心]]、[[小喀嚓]]〕{{r|hj}}
<!---->
|绿叶季书籍=《[[学徒探索]]》、<br/>《[[鹰翅的旅程]]》
|绿叶季事件=
* 梅柳生下了幼崽，鹰翅同意当他们的养父。{{r|hj}}
* 族群的巫医们收到必须“拥抱暗影所得之物”的预言。{{r|vs1}}
* 赤杨爪出发寻找天族；沙风在路上死亡。{{r|vs1}}
** 巡逻队找到峡谷，但只发现暗尾的猫群。{{r|vs1}}
* 巡逻队撤退回湖区，并发现小桠和小紫罗兰。{{r|vs1}}
** 雷族收养小桠，影族收养小紫罗兰。{{r|vs1}}
|绿叶季出生=〔[[桠枝]]、[[紫罗兰光]]、[[波爪|{{LT|Wavepaw}}]]、[[柏爪]]、[[洼光]]、[[桦树皮]]、[[石板毛|{{LT|Slatefur}}]]、[[狮眼]]〕{{r|vs1}}、〔[[露泉]]、[[鳍跃]]、[[芦苇掌]]、[[砾鼻]]、[[浅天]]、[[花蜜歌]]、[[边须]]〕{{r|hj}}、〔[[柔皮]]、[[兔光]]、[[斑点簇]]、[[金雀掌|{{LT|Gorseclaw (TC)}}]]〕{{r|vs2}}
|绿叶季死亡=[[沙风]]{{r|vs1}}、[[雾羽]]{{r|vs1}}
<!---->
|落叶季书籍=《[[雷影交加]]》、<br/>《[[鹰翅的旅程]]》
|落叶季事件=
* 小云死亡；叶池暂代影族巫医，并开始训练洼爪。{{r|vs2}}
* 暗尾的猫群尾随赤杨心的探索队到达湖区，并开始威胁族群。{{r|vs2}}
* 部分影族学徒开始叛逃并加入暗尾的猫群，紫罗兰爪也被带走了。{{r|vs2}}
* 回声之歌离开天族并尝试寻找其他族群。{{r|hj}}
|落叶季出生=〔[[花茎 (暗影幻象)|花茎]]、[[蛇牙 (影族)|蛇牙]]、[[涡皮]]〕{{r|vs2}}
|落叶季死亡=[[小云]]{{r|vs2}}、[[荆豆皮]]{{r|vs2}}
<!---->
|秃叶季书籍=《[[雷影交加]]》、<br/>《[[鹰翅的旅程]]》
|秃叶季事件=
* 两脚兽攻击天族的湖边营区并带走了黄蜂须和烦躁爪；天族被迫再度踏上旅程。{{r|hj}}
* 鹰翅成为天族副族长。{{r|hj}}
* 天族在没有巫医的情况下爆发疾病。{{r|hj}}
** 回声之歌回到天族并救活了部分的族猫。{{r|hj}}
|秃叶季死亡=[[莱利池]]{{r|hj}}、[[火蕨]]{{r|hj}}、[[卵石光]]{{r|pk}}
}}

=== 35年 ===
{{时间轴
|新叶季书籍=《[[雷影交加]]》、<br/>《[[天空破碎]]》、<br/>《[[鹰翅的旅程]]》
|新叶季事件=
* 桠爪成为学徒。{{r|vs2}}
* 紫罗兰爪离开暗尾的猫群并重新加入影族。{{r|vs2}}
* 洼光成为正式巫医；叶池返回雷族。{{r|vs2}}
* 影族爆发黄咳症。{{r|vs2}}
** 解药肺疗草长在风族领地，但一星拒绝给予援助。{{r|vs2}}
* 鹰翅跟随回声之歌遗留的预言找到五尖叶，并跟随天空的血之小路前进。{{r|hjm}}
* 星族同意兔泉和隼飞将药草交给影族。{{r|vs2}}
* 乌霜死亡，虎心成为影族副族长。{{r|vs2}}
* 暗尾占领了影族领地。{{r|vs2}}
** 花楸星、褐皮和虎心离开影族领地，并暂时居于雷族。{{r|vs2}}
** 其他影族猫投靠暗尾。{{r|vs2}}
* 雷族、河族和风族联军企图抢回影族领地，但一星带风族逃离战场；族群猫战败。{{r|vs3}}
* 暗尾开始称自己的猫群为“{{LT|The Kin}}”。{{r|vs3}}
* 河族遭到“{{LT|The Kin}}”袭击，并撤退到雷族。{{r|vs3}}
* 族群猫夺回河族领地，“{{LT|The Kin}}”撤退到影族领地。{{r|vs3}}
* 天族找到湖区，并和其他族群会合。{{r|vs3}}
* 五族联合将“{{LT|The Kin}}”逐出湖区。{{r|vs3}}
** 暗尾和一星死亡。{{r|vs3}}
* 兔星成为风族族长。{{r|vs3}}
|新叶季出生=〔[[松果脚]]、[[蕨叶须]]、[[鸥攫]]〕{{r|vs3}}、〔[[雕翅]]、[[李石]]、[[贝壳毛]]、[[茎叶]]〕{{DR|vs3|4章|57}}
|新叶季死亡=〔[[杂毛 (影族)|{{LT|Kinkfur (SC)}}]]、[[黄蜂尾]]、[[蜂鼻]]、[[乌霜]]〕{{r|vs2}}、
〔[[鲈翅]]、[[雨]]、[[波弟]]、[[麦克斯 (泼皮猫)|麦克斯]]、[[松树鼻]]、[[花瓣毛]]、[[狐鼻]]、[[鹭翅 (河族)|鹭翅]]、[[荫皮 (暗影幻象)|{{LT|Shadepelt}}]]、[[暗尾]]、[[一星]]、[[松针尾]]〕{{r|vs3}}、
〔[[狮眼]]、[[桦树皮]]、[[雾云]]〕{{r|vs4|23章}}、[[曙皮]]{{r|vs4|23章}}
<!---->
|绿叶季书籍=《[[极夜无光]]》
|绿叶季事件=
* 桠爪和紫罗兰爪加入天族。
* 巡逻队出发寻找没能到达湖区的天族猫。
<!---->
|落叶季书籍=《[[极夜无光]]》{{r|vs4|11章}}、<br/>《[[虎心的阴影]]》{{r|ts|15章}}、<br/>《[[烈焰焚河]]》
|落叶季事件=
* 影族解散并与天族合并。{{r|vs4}}
** {{LT|Rowanclaw}}放弃影族族长职位。{{r|vs4}}
* 桠爪和鳍爪加入雷族。{{r|vs4}}
* 虎心离开影族，但之后带着幼崽们回归{{r|vs5}}，并成为影族族长；褐皮成为影族副族长。{{r|ts}}
|落叶季出生=〔[[扑步]]、[[影兆]]、[[光跃]]〕{{r|ts|18章}}、〔[[塔尖掌]]、[[凹泉]]、[[日束]]〕{{r|ts|32章}}、〔[[原鸽脚]]、[[鹌鹑羽 (破灭守则)|鹌鹑羽]]、[[晴皮]]〕{{r|ts}}、〔[[噼啪齿]]、[[斑毛 (破灭守则)|{{LT|Spotfur (TC)}}]]、[[飞须]]〕{{r|vs5|1章}}、〔[[亚麻脚]]、[[蹦须]]〕{{r|vs5}}、〔[[翻掌|{{LT|Flipclaw}}]]、[[海石竹耳]]、[[鬃霜]]〕{{r|vs5}}
|落叶季死亡=[[雪丛]]{{r|vs4|261}}、[[金盏花 (猫)|金盏花]]{{r|ts|18章}}、[[塔尖兆]]{{r|ts|31章}}、[[虎星 (暗影幻象)|虎心]]{{r|ts}}、
[[尖毛|{{LT|Spikefur (SC)}}]]{{r|vs5|11章}}、[[荨麻 (至亲)|荨麻]]{{r|vs5|15章}}、[[荆棘光]]{{r|vs5|16章}}、[[花楸掌|{{LT|Rowanclaw}}]]{{r|vs5|17章}}
<!---->
|秃叶季书籍=《[[褐皮的族群]]》{{r|ts|19章}}
|秃叶季事件=
* 小影经历了一场严重的癫痫，同时看到了大树砸向急水部落的幻象。{{r|tc}}
* 褐皮和鸽翅把小影带到了急水部落。{{r|tc}}
* 小影拯救了急水部落，也得到了尖石巫师的帮助。{{r|tc}}
* 褐皮放弃影族副族长职位；苜蓿尾继任。{{r|tc}}
}}

=== 36年 ===
{{时间轴
|新叶季书籍=《[[风暴来袭]]》{{r|vs6|19}}
|新叶季事件=
* 赤杨心用死亡浆果医治感染严重{{r|vs6|43}}的洼光。{{r|vs6|162}}
* 天族在其他族群拒绝给予援助{{r|vs6|192}}后离开湖区。{{r|vs6|203}}
* 杜松掌被披露曾试图给天族下毒，并因此被剥夺副族长职位，{{r|vs6|289-290}}但为救小影和小紫罗兰牺牲。{{r|vs6|317}}
* 天族被带回，{{r|vs6|318}}每个族群获得同等的领地。{{r|vs6|321}}
|新叶季出生=〔[[鸢挠]]、[[龟爬]]〕{{r|sfh|43}}
|新叶季死亡=[[杜松掌|{{LT|Juniperclaw (VS)}}]]{{r|vs6|313}}
<!---->
|绿叶季书籍=《[[松鼠飞的希望]]》{{r|sfh|5}}
|绿叶季事件={{Coming soon}}
|绿叶季出生=〔[[月桂爪]]、[[桃金娘爪]]〕{{cite}}、〔[[根泉]]、[[松针掌|松针爪]]〕{{r|bc1|16}}、〔[[林爪]]、[[苹果爪]]〕{{r|bc1|107}}、〔[[燕雀爪]]、[[焰爪 (雷族)|焰爪]]、[[小䴕]]〕{{r|sfh|253}}、〔[[树叶 (姐妹会)|{{LT|Leaf (SC)}}]]、[[松鼠 (猫)|松鼠]]、[[月亮]]〕{{r|sfh|405}}
|绿叶季死亡=[[白尾 (风族)|白尾]]{{r|sfh|1章}}、[[琥珀月]]{{r|sfh|5}}、[[月光]]{{r|sfh|254}}、[[云雀鸣 (暗影幻象)|云雀鸣]]{{r|sfh|194}}、[[叶池]]{{r|sfh|22章}}、[[小䴕]]{{r|sfh|253}}
<!---->
|落叶季出生=〔[[啁爪]]、[[扇爪]]、[[鸣爪 (破灭守则)|鸣爪]]〕{{cite}}、〔[[洒爪]]、[[雾爪 (破灭守则)|雾爪]]〕{{cite}}
<!---->
|秃叶季书籍=《[[迷失群星]]》{{r|bc1|5}}
|秃叶季事件={{Coming soon}}
|秃叶季出生=〔[[小灰 (破灭守则)|小灰]]、[[小霜 (破灭守则)|小霜]]、[[小薄雾]]〕{{r|bc1|108}}
}}

=== 37年 ===
{{时间轴
|新叶季书籍=《[[The Silent Thaw]]》{{r|bc2|12、31}}、<br/>《[[Veil of Shadows]]》
|新叶季事件={{Coming soon}}
|新叶季死亡=[[蚁毛 (影族)|蚁毛]]{{r|bc2|127}}、〔[[茎叶]]、[[松果脚]]、[[斑点簇]]〕{{r|bc3|193}}、〔[[莓鼻]]、[[玫瑰瓣]]、[[砂鼻]]〕{{r|bc3|272}}、〔[[柔皮]]、[[击石]]、[[烟霭]]、[[蕨叶须]]〕{{r|bc3|276}}
}}

== 参考文献 ==
{{Ref wiki|:en|Events_timeline}}
{{Reflist|20em|refs=
<ref name="pregnancy">{{Cite web |url=https://en.wikipedia.org/wiki/Kitten |title=Kitten |author= |work= |date=6 |quote=A feline litter usually consists of two to five kittens born after a gestation lasting between 64 and 67 days, with an average length of 66 days. }}</ref>
<ref name="btwCJandBP">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10151712196152454&id=29566467453&comment_id=10151714291732454 |title=How many time is there between the leaving of SkyClan and the birth of Bluestar ? |accessdate= |author=Vicky Holmes |work=Facebook |date=2013-03-15 |quote=About 20 human years.}}</ref>
<ref name="btwMVandGC">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10154655514752454&id=29566467453 |title=Vicky Holmes: 1/3 of the Erin Hunters! |accessdate= |author=Vicky Holmes |work=Facebook |date=2016-08-10 |quote=There are 9 years between the end of Mapleshade's Vengeance and the start of Goosefeather's Curse.}}</ref>
<ref name="btwMVandPC">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10154655514752454&id=29566467453 |title=Vicky Holmes: 1/3 of the Erin Hunters! |accessdate= |author=Vicky Holmes |work=Facebook |date=2016-08-10 |quote=Pinestar's Choice starts 3 Years after Mapleshade's death.}}</ref>
<ref name="frecklewishTC">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10153410747247454&id=29566467453&comment_id=10153416215182454 |title=Vicky Holmes: 1/3 of the Erin Hunters! |accessdate= |author=Vicky Holmes |work=Facebook |date=2015-04-11 |quote=Mari is right about Frecklewish dying}}</ref>
<ref name="windflightAge">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10155431255627454&id=29566467453&comment_id=10155434955517454 |title=Vicky Holmes: 1/3 of the Erin Hunters! |accessdate= |author=Su Susann |work=Facebook |date=2017-04-11 |quote=Windflight is a young warrior when we see him first in Pc(ch3). He just recieved his name three moons ago.}}</ref>
<ref name="deathOfBouldfurTroutstreamSunstrikeWebfoot">{{Cite web |url=http://www.facebook.com/permalink.php?story_fbid=10153597177322454&id=29566467453&comment_id=10153611884997454&offset=0&total_comments=2&comment_tracking=%7B%22tn%22%3A%22R%22%7D |title=Merci Varga - Hello^^ Does Ripplestar went to StarClan or... |accessdate= 2019-08-03|author=Vicky Holmes |work=Facebook |date=2015-06-24 |quote=The other cats died in the battle.}}</ref>
<ref name="kitsOfSnowBirdQ">{{Cite web |url=http://blogclan.katecary.co.uk/2016/09/05/thunder-and-shadow-spoiler-page/comment-page-13/#comment-52029 |title=Thunder and Shadow Spoiler Page |accessdate= |author=Brackenblaze (Firepup16) |work=BlogClan |date=2016-09-14 |quote=Yarrowleaf and Beenose were introduced in TAQ so obviously they had to have been two of those three kits. What happened to the third kit? Also she(Snowbird)'s confirmed to be the mother of Berryheart, Rippletail, and Cloverfoot.}}</ref>
<ref name="kitsOfSnowBirdA">{{Cite web |url=http://blogclan.katecary.co.uk/2016/09/05/thunder-and-shadow-spoiler-page/comment-page-13/#comment-52408 |title=Thunder and Shadow Spoiler Page |accessdate= |author=Kate Cary |work=BlogClan |date=2016-09-15 |quote=Yes and the third she-kit died young and they were the litter she was expecting in Eclipse.}}</ref>
<ref name="bluebellkit">{{Cite web |url=http://blogclan.katecary.co.uk/2016/09/05/thunder-and-shadow-spoiler-page/comment-page-13/#comment-52414 |title=Thunder and Shadow Spoiler Page |accessdate= |author=Kate Cary |work=BlogClan |date=2016-09-15 |quote=Bluebellkit – she looked like her other – white fur, green eyes.}}</ref>
<ref name="deathOfPrincess">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10154772683937454&id=29566467453 |title=Vicky Holmes: 1/3 of the Erin Hunters!  |accessdate=2016-09-17 |author=Su Susann |work=Facebook |date=2016-09-17 |quote=Since Princess is very old now, we can say she fell asleep in her nest with her twolegs around her, the spring where the flood was on Bramblestar's Storm. She went to nowhere like all kittypets.}}</ref>
<!--<ref name="deathOfSmokefootAndWhitewater">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10154847540452454&id=29566467453&comment_id=10154848205962454&comment_tracking=%7B%22tn%22%3A%22R%22%7D |title=Vicky Holmes: 1/3 of the Erin Hunters!  |accessdate=2016-10-12 |author=Su Susann |work=Facebook |date=2016-10-12 |quote=Smokefoot and Whitewater died of old age in Bramblestar's Storm, at the end of newleaf after they made the 16. Code. They went to StarClan. }}</ref>-->
<ref name="ageOfSnowbirdAndRatscar">{{Cite web |url=https://www.facebook.com/permalink.php?story_fbid=10154822860672454&id=29566467453&comment_id=10154823989002454 |title=Vicky Holmes: 1/3 of the Erin Hunters! |accessdate= |author=Su Susann |work=Facebook |date=2006-10-04 |quote=Since Ratscar is described as a young warrior in Tigerclaw's Fury I'm sure he just got his name and his sister too. They were born in the middle of greenleaf, whyle Firepaw trains in ThunderClan. They were made apprentices in the middle of leaf-bare. They were made warriors in the middle of greenleaf, the moon Whitethroat gets killed by the monster.}}</ref>
}}'''

    N = 1000
    M = 2000
    seasons = {
        '新叶季': 3,
        '绿叶季': 6,
        '落叶季': 9,
        '秃叶季': 12
        }

    years = ['N+1', 'N+2', 'N+3', 'N+4', '0', '8', '10', '11', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37']
    # start = False
    for y in years:
        tl_prev_content = '=== ' + y + '年 ===\n'
        tl_start_content = '{{时间轴\n'
        tl_end_content = '}}\n\n=='

        tl_prev = text.index(tl_prev_content)
        tl_start = text.index(tl_start_content, tl_prev)
        tl_end = text.index(tl_end_content, tl_start)

        tl = text[tl_start:tl_end]

        if 'N' in y:
            year = N + int(y[2:])
        else:
            year = M + int(y)

        for s in seasons:
            field_start = tl.find('|' + s + '死亡=')
            if field_start == -1: continue
            field_end = tl.index('\n', field_start)
            field = tl[field_start:field_end]

            season = seasons[s]

            title_start = field.find('[[') + 2
            while title_start != 1:
                title_end = field.index(']]', title_start)

                title = field[title_start:title_end]
                title_find_pipe = title.find('|')
                if title_find_pipe != -1:
                    title = title[:title_find_pipe]

                print(title)
                # if title == '鬃霜':
                #     start = True
                # if not start:
                #     title_start = field.find('[[', title_end) + 2
                #     continue

                qid = zh2cp.characters[title]
                item = pywikibot.ItemPage(repo, qid)
                item.get()
                if 'P96' not in item.claims: # 死亡于时间线
                    claim = pywikibot.Claim(repo, 'P96')

                    byear = year
                    bseason = season
                    while True:
                        try:
                            books = cp2zh.works[timeline[byear][bseason][0][0]]
                        except KeyError:
                            if bseason == 12:
                                bseason = 3
                                byear += 1
                            else:
                                bseason += 3
                            continue
                        else:
                            chapter = timeline[byear][bseason][0][1]
                            break

                    for bk in books:
                        if '{0}[{1}]'.format(bk, chapter) in zh2cp.works:
                            book = bk
                            break

                    ctarget = pywikibot.ItemPage(repo, zh2cp.works[book + '[' + chapter + ']'])
                    claim.setTarget(ctarget)
                    print(book, chapter)
                    item.addClaim(claim)

                    if byear != year or bseason != season:
                        item = pywikibot.ItemPage(repo, qid)
                        item.get()
                        qualifier = pywikibot.Claim(repo, 'P94') # 时间线位移

                        moon = - (12 * (byear - year) + (bseason - season))

                        qtarget = pywikibot.WbQuantity(moon, unit=pywikibot.ItemPage(repo, 'Q2294'), site=cp) # 月
                        qualifier.setTarget(qtarget)
                        print(moon)
                        item.claims['P96'][0].addQualifier(qualifier)

                title_start = field.find('[[', title_end) + 2

if __name__ == '__main__':
    main()
